In [1]:
# Importing dependencies
import pandas as pd

In [2]:
# Reading the dataframes
child_mortality = pd.read_csv('Dataset/healthdata/child-mortality.csv')
hiv_deaths = pd.read_csv('Dataset/healthdata/deaths-and-new-cases-of-hiv.csv')
life_expectency = pd.read_csv('Dataset/healthdata/life-expectancy.csv')
population = pd.read_csv('Dataset/healthdata/projected-population-by-country.csv')
heart_disease = pd.read_csv('Dataset/healthdata/share-deaths-heart-disease.csv')
tuberculosis = pd.read_csv('Dataset/healthdata/tuberculosis-deaths-region.csv')

# Cleaning up the dataset

In [3]:
# Child mortality rates
child_mortality1 = child_mortality['Year'].max()
child_mortality1

2016

In [4]:
child_mortality2 = child_mortality[child_mortality['Year']==2016]
child_mortality2

               Entity Code  Year  Child mortality rates (%)
59        Afghanistan  AFG  2016                     7.0400
98            Albania  ALB  2016                     1.3500
161           Algeria  DZA  2016                     2.5200
188           Andorra  AND  2016                     0.2700
225            Angola  AGO  2016                     8.2500
...               ...  ...   ...                        ...
13314         Vietnam  VNM  2016                     2.1600
13317  Western Sahara  ESH  2016                     3.6388
13382           Yemen  YEM  2016                     5.5300
13447          Zambia  ZMB  2016                     6.3400
13511        Zimbabwe  ZWE  2016                     5.6400

[211 rows x 4 columns]

In [5]:
# Hiv Deaths
hiv_deaths.columns

Index(['Entity', 'Code', 'Year', 'Deaths', 'Prevalence', 'Incidences'], dtype='object')

In [6]:
hiv_deaths.head()

        Entity Code  Year     Deaths  Prevalence  Incidences
0  Afghanistan  AFG  1990  32.098129  398.257783   78.304642
1  Afghanistan  AFG  1991  37.524158  438.019845   83.233703
2  Afghanistan  AFG  1992  50.670559  543.250161  104.710195
3  Afghanistan  AFG  1993  58.433049  668.869833  128.605343
4  Afghanistan  AFG  1994  65.531176  735.565331  136.848748

In [7]:
# Obtaining the latest year
hiv_deaths['Year'].max()

2017

In [8]:
hiv_deaths1 = hiv_deaths[hiv_deaths['Year']==2017]
hiv_deaths1

,Entity,Code,Year,Deaths,Prevalence,Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [9]:
hiv_deaths2 = hiv_deaths1.rename(columns={'Deaths':'HIV Deaths', 'Incidences':'HIV Incidences'})
hiv_deaths2

,Entity,Code,Year,HIV Deaths,Prevalence,HIV Incidences
27,Afghanistan,AFG,2017,302.166880,4.730034e+03,9.221735e+02
55,Albania,ALB,2017,1.285800,3.187413e+01,3.030192e+00
83,Algeria,DZA,2017,326.660742,1.125392e+04,9.008058e+02
111,American Samoa,ASM,2017,0.335763,4.887205e+00,6.577304e-01
139,Andean Latin America,NaN,2017,4655.939469,1.388683e+05,1.238097e+04
...,...,...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,256899.798300,5.852181e+06,3.604100e+05
6383,World,OWID_WRL,2017,954491.747200,3.682224e+07,1.942071e+06
6411,Yemen,YEM,2017,387.383175,6.962759e+03,1.082583e+03
6439,Zambia,ZMB,2017,21806.824350,1.200474e+06,4.683891e+04
6467,Zimbabwe,ZWE,2017,16065.329680,1.297676e+06,5.625906e+04

In [10]:
# Dropping Columns
hiv_deaths3 = hiv_deaths2.drop(columns=['Prevalence','Code','Year'])
hiv_deaths3

                          Entity     HIV Deaths  HIV Incidences
27                   Afghanistan     302.166880    9.221735e+02
55                       Albania       1.285800    3.030192e+00
83                       Algeria     326.660742    9.008058e+02
111               American Samoa       0.335763    6.577304e-01
139         Andean Latin America    4655.939469    1.238097e+04
...                          ...            ...             ...
6355  Western Sub-Saharan Africa  256899.798300    3.604100e+05
6383                       World  954491.747200    1.942071e+06
6411                       Yemen     387.383175    1.082583e+03
6439                      Zambia   21806.824350    4.683891e+04
6467                    Zimbabwe   16065.329680    5.625906e+04

[231 rows x 3 columns]

In [11]:
# Life Expectency
life_expectency.head()

        Entity Code  Year  Life expectancy
0  Afghanistan  AFG  1950           27.638
1  Afghanistan  AFG  1951           27.878
2  Afghanistan  AFG  1952           28.361
3  Afghanistan  AFG  1953           28.852
4  Afghanistan  AFG  1954           29.350

In [12]:
life_expectency['Year'].max()

2019

In [13]:
# Obtaining the latest data
life_expectency1 = life_expectency[life_expectency['Year']==2019]
life_expectency1

               Entity      Code  Year  Life expectancy
69        Afghanistan       AFG  2019           64.833
141            Africa       NaN  2019           63.170
211           Albania       ALB  2019           78.573
284           Algeria       DZA  2019           76.880
354    American Samoa       ASM  2019           73.745
...               ...       ...   ...              ...
18740  Western Sahara       ESH  2019           70.263
18817           World  OWID_WRL  2019           72.584
18887           Yemen       YEM  2019           66.125
18957          Zambia       ZMB  2019           63.886
19027        Zimbabwe       ZWE  2019           61.490

[243 rows x 4 columns]

In [14]:
life_expectency2 = life_expectency1.drop(columns=['Code', 'Year'])
life_expectency2

               Entity  Life expectancy
69        Afghanistan           64.833
141            Africa           63.170
211           Albania           78.573
284           Algeria           76.880
354    American Samoa           73.745
...               ...              ...
18740  Western Sahara           70.263
18817           World           72.584
18887           Yemen           66.125
18957          Zambia           63.886
19027        Zimbabwe           61.490

[243 rows x 2 columns]

In [15]:
# Population Data by Country
population

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
0,Afghanistan,AFG,1800,3280000
1,Afghanistan,AFG,1801,3280000
2,Afghanistan,AFG,1802,3280000
3,Afghanistan,AFG,1803,3280000
4,Afghanistan,AFG,1804,3280000
...,...,...,...,...
66480,Zimbabwe,ZWE,2096,30941000
66481,Zimbabwe,ZWE,2097,30952000
66482,Zimbabwe,ZWE,2098,30960000
66483,Zimbabwe,ZWE,2099,30964000
66484,Zimbabwe,ZWE,2100,30965000

In [16]:
# Latest year
population['Year'].max()

2100

In [17]:
# Obtaining Population as of 2019
population1 = population[population['Year']==2019]
population1

,Entity,Code,Year,"Population by country and region, historic and projections (Gapminder, HYDE & UN)"
219,Afghanistan,AFG,2019,38042000
422,Africa,NaN,2019,1308064000
723,Albania,ALB,2019,2881000
1024,Algeria,DZA,2019,43053000
1175,American Samoa,ASM,2019,55000
...,...,...,...,...
65268,Western Sahara,ESH,2019,582000
65500,World,OWID_WRL,2019,7713468000
65801,Yemen,YEM,2019,29162000
66102,Zambia,ZMB,2019,17861000
66403,Zimbabwe,ZWE,2019,14645000

In [18]:
# Renaming the column
population2 = population1.rename(columns={'Population by country and region, historic and projections (Gapminder, HYDE & UN)': 'Population'})
population2

               Entity      Code  Year  Population
219       Afghanistan       AFG  2019    38042000
422            Africa       NaN  2019  1308064000
723           Albania       ALB  2019     2881000
1024          Algeria       DZA  2019    43053000
1175   American Samoa       ASM  2019       55000
...               ...       ...   ...         ...
65268  Western Sahara       ESH  2019      582000
65500           World  OWID_WRL  2019  7713468000
65801           Yemen       YEM  2019    29162000
66102          Zambia       ZMB  2019    17861000
66403        Zimbabwe       ZWE  2019    14645000

[242 rows x 4 columns]

In [19]:
# Dropping the year and code
population3 = population2.drop(columns=['Year', 'Code'])
population3

               Entity  Population
219       Afghanistan    38042000
422            Africa  1308064000
723           Albania     2881000
1024          Algeria    43053000
1175   American Samoa       55000
...               ...         ...
65268  Western Sahara      582000
65500           World  7713468000
65801           Yemen    29162000
66102          Zambia    17861000
66403        Zimbabwe    14645000

[242 rows x 2 columns]

In [20]:
# Heart Disease Data cleaning
heart_disease.head()

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
0,Afghanistan,AFG,1990,23.707752
1,Afghanistan,AFG,1991,23.490307
2,Afghanistan,AFG,1992,23.146918
3,Afghanistan,AFG,1993,21.154207
4,Afghanistan,AFG,1994,19.756144

In [21]:
heart_disease['Year'].max()

2017

In [22]:
heart_disease1 = heart_disease[heart_disease['Year']==2017]
heart_disease1

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)
27,Afghanistan,AFG,2017,24.780577
55,Albania,ALB,2017,55.822085
83,Algeria,DZA,2017,47.284557
111,American Samoa,ASM,2017,30.440218
139,Andean Latin America,NaN,2017,21.193030
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,10.304049
6383,World,OWID_WRL,2017,31.800515
6411,Yemen,YEM,2017,32.373980
6439,Zambia,ZMB,2017,10.277008
6467,Zimbabwe,ZWE,2017,14.430736

In [23]:
heart_disease2 = heart_disease1.drop(columns=['Year', 'Code']).rename(columns={'Deaths - Cardiovascular diseases - Sex: Both - Age: All Ages (Percent)':'Cardiovascular Deaths %'})
heart_disease2

                          Entity  Cardiovascular Deaths %
27                   Afghanistan                24.780577
55                       Albania                55.822085
83                       Algeria                47.284557
111               American Samoa                30.440218
139         Andean Latin America                21.193030
...                          ...                      ...
6355  Western Sub-Saharan Africa                10.304049
6383                       World                31.800515
6411                       Yemen                32.373980
6439                      Zambia                10.277008
6467                    Zimbabwe                14.430736

[231 rows x 2 columns]

In [24]:
# Tuberculosis Data
tuberculosis.head()

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
0,Afghanistan,AFG,1990,4332.690583
1,Afghanistan,AFG,1991,4288.640464
2,Afghanistan,AFG,1992,4475.257542
3,Afghanistan,AFG,1993,4909.050325
4,Afghanistan,AFG,1994,5352.634058

In [25]:
# Latest year
tuberculosis['Year'].max()

2017

In [26]:
# Filtering based on latest year
tuberculosis1 = tuberculosis[tuberculosis['Year']==2017]
tuberculosis1

,Entity,Code,Year,Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)
27,Afghanistan,AFG,2017,3.634061e+03
55,Albania,ALB,2017,1.198700e+01
83,Algeria,DZA,2017,4.170693e+02
111,American Samoa,ASM,2017,3.769006e-01
139,Andean Latin America,NaN,2017,3.884472e+03
...,...,...,...,...
6355,Western Sub-Saharan Africa,NaN,2017,1.297312e+05
6383,World,OWID_WRL,2017,1.183672e+06
6411,Yemen,YEM,2017,1.021099e+03
6439,Zambia,ZMB,2017,8.306847e+03
6467,Zimbabwe,ZWE,2017,1.195807e+04

In [27]:
# Dropping and renaming the column
tuberculosis2 = tuberculosis1.drop(columns=['Code', 'Year']).rename(columns={'Deaths - Tuberculosis - Sex: Both - Age: All Ages (Number)':'TB Deaths'})
tuberculosis2

                          Entity     TB Deaths
27                   Afghanistan  3.634061e+03
55                       Albania  1.198700e+01
83                       Algeria  4.170693e+02
111               American Samoa  3.769006e-01
139         Andean Latin America  3.884472e+03
...                          ...           ...
6355  Western Sub-Saharan Africa  1.297312e+05
6383                       World  1.183672e+06
6411                       Yemen  1.021099e+03
6439                      Zambia  8.306847e+03
6467                    Zimbabwe  1.195807e+04

[231 rows x 2 columns]

In [28]:
# Creating a single CSV File for later visualisation
merged_df = pd.merge(child_mortality2,hiv_deaths3, on='Entity', how='inner')
merged_df

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458
1,Albania,ALB,2016,1.35,1.285800,3.030192
2,Algeria,DZA,2016,2.52,326.660742,900.805751
3,Andorra,AND,2016,0.27,0.441990,4.594938
4,Angola,AGO,2016,8.25,14584.702430,19017.694410
...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980
187,Yemen,YEM,2016,5.53,387.383175,1082.582833
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940

In [29]:
# Merging with Life Expectency Dataframe
merged_df1 = pd.merge(merged_df, life_expectency2, how='inner', on='Entity')
merged_df1

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147
...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490

In [30]:
# Merging with population
merged_df2 = pd.merge(merged_df1,population3, how='inner', on='Entity')
merged_df2

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000
...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000

In [31]:
# Merging with Heart Disease
merged_df3 = pd.merge(merged_df2, heart_disease2, on='Entity', how='inner')
merged_df3

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254
...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736

In [32]:
# Merging with the TB Data
merged_df4 = pd.merge(merged_df3, tuberculosis2, how='inner', on='Entity')
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530
...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530

In [33]:
# Converting percentages to absolute numbers
merged_df4['Child Mortality'] = (merged_df4['Child mortality rates (%)']/100)*merged_df4['Population']
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5
...,...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0

In [34]:
# Converting cardiovascular rates to absolute numbers
merged_df4['Cardiovascular Deaths'] = (merged_df4['Cardiovascular Deaths %']/100) * merged_df4['Population']
merged_df4

,Entity,Code,Year,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths
0,Afghanistan,AFG,2016,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06
1,Albania,ALB,2016,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06
2,Algeria,DZA,2016,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07
3,Andorra,AND,2016,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04
4,Angola,AGO,2016,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06
...,...,...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,VEN,2016,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06
186,Vietnam,VNM,2016,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07
187,Yemen,YEM,2016,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06
188,Zambia,ZMB,2016,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06
189,Zimbabwe,ZWE,2016,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06

In [35]:
# Renaming Entity to Country and dropping Year and Code
merged_df6 = merged_df4.drop(columns=['Code', 'Year']).rename(columns={'Entity':'Country'})
merged_df6

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06
...,...,...,...,...,...,...,...,...,...,...
185,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06
186,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07
187,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06
188,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06
189,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06

In [36]:
# Diabetes dataframe
diabetes = pd.read_csv('Dataset/healthdata/diabetes-prevalence.csv')
diabetes

,Entity,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,AFG,9.59000
1,Albania,ALB,10.08000
2,Algeria,DZA,6.73000
3,Andorra,AND,7.97000
4,Angola,AGO,3.94000
...,...,...,...
248,Vietnam,VNM,6.00000
249,World,OWID_WRL,8.50963
250,Yemen,YEM,5.35000
251,Zambia,ZMB,3.94000
252,Zimbabwe,ZWE,1.82000

In [37]:
diabetes1 = diabetes.rename(columns={'Entity':'Country'})
diabetes1

,Country,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,AFG,9.59000
1,Albania,ALB,10.08000
2,Algeria,DZA,6.73000
3,Andorra,AND,7.97000
4,Angola,AGO,3.94000
...,...,...,...
248,Vietnam,VNM,6.00000
249,World,OWID_WRL,8.50963
250,Yemen,YEM,5.35000
251,Zambia,ZMB,3.94000
252,Zimbabwe,ZWE,1.82000

In [38]:
# Merging the dataframe
merged_df7 = pd.merge(merged_df6, diabetes1, how='inner', on='Country')
merged_df7

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Code,Diabetes prevalence (% of population ages 20 to 79)
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,AFG,9.59
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,ALB,10.08
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,DZA,6.73
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,AND,7.97
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,AGO,3.94
...,...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,VEN,6.47
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,VNM,6.00
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,YEM,5.35
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,ZMB,3.94
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,ZWE,1.82

In [39]:
merged_df8 = merged_df7.drop(columns=['Code']).rename(columns={'Diabetes prevalence (% of population ages 20 to 79)':'Diabetes Incidence'})
merged_df8

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Diabetes Incidence
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,9.59
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,10.08
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,6.73
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,7.97
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,3.94
...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,6.47
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,6.00
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,5.35
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,3.94
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,1.82

In [40]:
merged_df8['Diabetes Rates'] = (merged_df8['Diabetes Incidence']/100)*merged_df8['Population']
merged_df9 = merged_df8.drop(columns=['Diabetes Incidence'])
merged_df9

,Country,Child mortality rates (%),HIV Deaths,HIV Incidences,Life expectancy,Population,Cardiovascular Deaths %,TB Deaths,Child Mortality,Cardiovascular Deaths,Diabetes Rates
0,Afghanistan,7.04,302.166880,922.173458,64.833,38042000,24.780577,3634.060664,2678156.8,9.427027e+06,3648227.8
1,Albania,1.35,1.285800,3.030192,78.573,2881000,55.822085,11.986996,38893.5,1.608234e+06,290404.8
2,Algeria,2.52,326.660742,900.805751,76.880,43053000,47.284557,417.069297,1084935.6,2.035742e+07,2897466.9
3,Andorra,0.27,0.441990,4.594938,83.732,77000,30.647196,0.357184,207.9,2.359834e+04,6136.9
4,Angola,8.25,14584.702430,19017.694410,61.147,31825000,11.828254,11409.417530,2625562.5,3.764342e+06,1253905.0
...,...,...,...,...,...,...,...,...,...,...,...
184,Venezuela,1.63,2127.569960,8195.995527,72.064,28516000,30.540530,786.710928,464810.8,8.708938e+06,1844985.2
185,Vietnam,2.16,11434.047180,19075.495980,75.400,96462000,33.177107,17594.454380,2083579.2,3.200330e+07,5787720.0
186,Yemen,5.53,387.383175,1082.582833,66.125,29162000,32.373980,1021.099125,1612658.6,9.440900e+06,1560167.0
187,Zambia,6.34,21806.824350,46838.910870,63.886,17861000,10.277008,8306.847486,1132387.4,1.835576e+06,703723.4
188,Zimbabwe,5.64,16065.329680,56259.055940,61.490,14645000,14.430736,11958.066530,825978.0,2.113381e+06,266539.0

In [41]:
# Exporting the Dataframe as a cleaned CSV file
merged_df9.to_csv('cleaned_dataset/heatlh_data_by_country.csv', index=False)

In [42]:
# Creating a list of countries
countries_list = merged_df9['Country'].tolist()
countries_list[:5]

['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola']

In [43]:
# Environment Data
co2_emission = pd.read_csv('Dataset/environmentdata/annual-co2-emissions-per-country.csv')
plastic_waste = pd.read_csv('Dataset/environmentdata/plastic-waste-generation-total.csv')
particulate_pollution = pd.read_csv('Dataset/environmentdata/PM25-air-pollution.csv')
forest_cover = pd.read_csv('Dataset/environmentdata/forest-area-as-share-of-land-area.csv')

In [44]:
forest_cover

           Entity Code  Year  Forest cover
0     Afghanistan  AFG  1990      1.850994
1     Afghanistan  AFG  1991      1.850994
2     Afghanistan  AFG  1992      1.850994
3     Afghanistan  AFG  1993      1.850994
4     Afghanistan  AFG  1994      1.850994
...           ...  ...   ...           ...
7969     Zimbabwe  ZWE  2016     45.570273
7970     Zimbabwe  ZWE  2017     45.451183
7971     Zimbabwe  ZWE  2018     45.332093
7972     Zimbabwe  ZWE  2019     45.213002
7973     Zimbabwe  ZWE  2020     45.093912

[7974 rows x 4 columns]

In [45]:
# Filtering by first and last year of reporting
forest_cover1 = forest_cover[(forest_cover['Year']==1990) | (forest_cover['Year']==2019)]
forest_cover1

           Entity Code  Year  Forest cover
0     Afghanistan  AFG  1990      1.850994
29    Afghanistan  AFG  2019      1.850994
31         Africa  NaN  1990     24.856428
60         Africa  NaN  2019     21.436713
62        Albania  ALB  1990     28.788321
...           ...  ...   ...           ...
7910        Yemen  YEM  2019      1.039832
7912       Zambia  ZMB  1990     63.778098
7941       Zambia  ZMB  2019     60.536521
7943     Zimbabwe  ZWE  1990     48.666615
7972     Zimbabwe  ZWE  2019     45.213002

[488 rows x 4 columns]

In [46]:
# Deforestation Percentage Change
forest_cover1['Deforestation Rate'] = (forest_cover1['Forest cover'].pct_change()) * 100
forest_cover1

           Entity Code  Year  Forest cover  Deforestation Rate
0     Afghanistan  AFG  1990      1.850994                 NaN
29    Afghanistan  AFG  2019      1.850994            0.000000
31         Africa  NaN  1990     24.856428         1242.869136
60         Africa  NaN  2019     21.436713          -13.757870
62        Albania  ALB  1990     28.788321           34.294474
...           ...  ...   ...           ...                 ...
7910        Yemen  YEM  2019      1.039832            0.000000
7912       Zambia  ZMB  1990     63.778098         6033.501310
7941       Zambia  ZMB  2019     60.536521           -5.082587
7943     Zimbabwe  ZWE  1990     48.666615          -19.607842
7972     Zimbabwe  ZWE  2019     45.213002           -7.096472

[488 rows x 5 columns]

In [47]:
# Filtering out deforrestation rates from the dataframe
forest_cover2 = forest_cover1.drop(columns=['Code',	'Forest cover'])
forest_cover2

           Entity  Year  Deforestation Rate
0     Afghanistan  1990                 NaN
29    Afghanistan  2019            0.000000
31         Africa  1990         1242.869136
60         Africa  2019          -13.757870
62        Albania  1990           34.294474
...           ...   ...                 ...
7910        Yemen  2019            0.000000
7912       Zambia  1990         6033.501310
7941       Zambia  2019           -5.082587
7943     Zimbabwe  1990          -19.607842
7972     Zimbabwe  2019           -7.096472

[488 rows x 3 columns]

In [48]:
forest_cover3 = forest_cover2[forest_cover2['Year']==2019]
forest_cover3

              Entity  Year  Deforestation Rate
29       Afghanistan  2019            0.000000
60            Africa  2019          -13.757870
91           Albania  2019            0.019967
122          Algeria  2019           17.000600
153   American Samoa  2019           -5.035971
...              ...   ...                 ...
7848  Western Sahara  2019           -0.015637
7879           World  2019           -4.072102
7910           Yemen  2019            0.000000
7941          Zambia  2019           -5.082587
7972        Zimbabwe  2019           -7.096472

[262 rows x 3 columns]

In [49]:
# Co2 Emission
co2_emission.head()

        Entity Code  Year  Annual CO2 emissions
0  Afghanistan  AFG  1949              0.014656
1  Afghanistan  AFG  1950              0.084272
2  Afghanistan  AFG  1951              0.091600
3  Afghanistan  AFG  1952              0.091600
4  Afghanistan  AFG  1953              0.106256

In [50]:
# Latest year
co2_emission['Year'].max()

2018

In [51]:
co2_emission1 = co2_emission[co2_emission['Year']==2018]
co2_emission1

                          Entity      Code  Year  Annual CO2 emissions
69                   Afghanistan       AFG  2018              9.438789
337                       Africa       NaN  2018           1400.841210
423                      Albania       ALB  2018              4.569964
532                      Algeria       DZA  2018            155.725261
561                      Andorra       AND  2018              0.470909
...                          ...       ...   ...                   ...
22750  Wallis and Futuna Islands       NaN  2018              0.027057
23018                      World  OWID_WRL  2018          36572.754220
23087                      Yemen       YEM  2018             10.140644
23244                     Zambia       ZMB  2018              5.228035
23371                   Zimbabwe       ZWE  2018             12.262698

[233 rows x 4 columns]

In [52]:
co2_emission2 = co2_emission1.rename(columns={'Annual CO2 emissions':'Annual CO2 emissions (ppm)'})
co2_emission2

                          Entity      Code  Year  Annual CO2 emissions (ppm)
69                   Afghanistan       AFG  2018                    9.438789
337                       Africa       NaN  2018                 1400.841210
423                      Albania       ALB  2018                    4.569964
532                      Algeria       DZA  2018                  155.725261
561                      Andorra       AND  2018                    0.470909
...                          ...       ...   ...                         ...
22750  Wallis and Futuna Islands       NaN  2018                    0.027057
23018                      World  OWID_WRL  2018                36572.754220
23087                      Yemen       YEM  2018                   10.140644
23244                     Zambia       ZMB  2018                    5.228035
23371                   Zimbabwe       ZWE  2018                   12.262698

[233 rows x 4 columns]

In [53]:
co2_emission3 = co2_emission2.drop(columns=['Code','Year'])
co2_emission3

                          Entity  Annual CO2 emissions (ppm)
69                   Afghanistan                    9.438789
337                       Africa                 1400.841210
423                      Albania                    4.569964
532                      Algeria                  155.725261
561                      Andorra                    0.470909
...                          ...                         ...
22750  Wallis and Futuna Islands                    0.027057
23018                      World                36572.754220
23087                      Yemen                   10.140644
23244                     Zambia                    5.228035
23371                   Zimbabwe                   12.262698

[233 rows x 2 columns]

In [54]:
# plastic waste generation
plastic_waste

                  Entity Code  Plastic waste generation (tonnes, total)
0                Albania  ALB                                     73364
1                Algeria  DZA                                   1898343
2                 Angola  AGO                                    528843
3    Antigua and Barbuda  ATG                                     22804
4              Argentina  ARG                                   2753550
..                   ...  ...                                       ...
163              Uruguay  URY                                    310379
164              Vanuatu  VUT                                     25443
165            Venezuela  VEN                                   2669998
166              Vietnam  VNM                                   3268227
167                Yemen  YEM                                    887497

[168 rows x 3 columns]

In [55]:
plastic_waste.loc[0] = ['Afghanistan','AFG',112000]

In [56]:
plastic_waste1 = plastic_waste.drop(columns=['Code'])
plastic_waste1

                  Entity  Plastic waste generation (tonnes, total)
0            Afghanistan                                    112000
1                Algeria                                   1898343
2                 Angola                                    528843
3    Antigua and Barbuda                                     22804
4              Argentina                                   2753550
..                   ...                                       ...
163              Uruguay                                    310379
164              Vanuatu                                     25443
165            Venezuela                                   2669998
166              Vietnam                                   3268227
167                Yemen                                    887497

[168 rows x 2 columns]

In [57]:
# Particle pollution
particulate_pollution

,Entity,Code,Year,"PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)"
0,Afghanistan,AFG,1990,60.936690
1,Afghanistan,AFG,1995,56.136628
2,Afghanistan,AFG,2000,56.092028
3,Afghanistan,AFG,2005,43.234032
4,Afghanistan,AFG,2010,46.536809
...,...,...,...,...
2635,Zimbabwe,ZWE,2012,23.359478
2636,Zimbabwe,ZWE,2013,23.448376
2637,Zimbabwe,ZWE,2014,23.072327
2638,Zimbabwe,ZWE,2015,24.371786
2639,Zimbabwe,ZWE,2016,24.513035

In [58]:
# Latest year
particulate_pollution['Year'].max()

2016

In [59]:
particulate_pollution1 = particulate_pollution[particulate_pollution['Year']==2016]
particulate_pollution1

,Entity,Code,Year,"PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)"
10,Afghanistan,AFG,2016,62.854857
21,Albania,ALB,2016,14.634008
32,Algeria,DZA,2016,37.230956
43,American Samoa,ASM,2016,3.763412
54,Andorra,AND,2016,10.879472
...,...,...,...,...
2595,Vietnam,VNM,2016,26.285906
2606,World,OWID_WRL,2016,49.673465
2617,Yemen,YEM,2016,72.553865
2628,Zambia,ZMB,2016,30.550295
2639,Zimbabwe,ZWE,2016,24.513035

In [60]:
particulate_pollution2 = particulate_pollution1.drop(columns=['Code','Year']).rename(columns={'PM2.5 air pollution, mean annual exposure (micrograms per cubic meter)':'PM2.5 air pollution(micrograms per cubic meter)'})
particulate_pollution2

              Entity  PM2.5 air pollution(micrograms per cubic meter)
10       Afghanistan                                        62.854857
21           Albania                                        14.634008
32           Algeria                                        37.230956
43    American Samoa                                         3.763412
54           Andorra                                        10.879472
...              ...                                              ...
2595         Vietnam                                        26.285906
2606           World                                        49.673465
2617           Yemen                                        72.553865
2628          Zambia                                        30.550295
2639        Zimbabwe                                        24.513035

[240 rows x 2 columns]

In [61]:
# Merging the dataframes by country
env_df = pd.merge(co2_emission3, forest_cover3, how='inner',on='Entity')
env_df

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate
0,Afghanistan,9.438789,2019,0.000000
1,Africa,1400.841210,2019,-13.757870
2,Albania,4.569964,2019,0.019967
3,Algeria,155.725261,2019,17.000600
4,Andorra,0.470909,2019,0.000000
...,...,...,...,...
209,Wallis and Futuna Islands,0.027057,2019,0.517241
210,World,36572.754220,2019,-4.072102
211,Yemen,10.140644,2019,0.000000
212,Zambia,5.228035,2019,-5.082587
213,Zimbabwe,12.262698,2019,-7.096472

In [62]:
env_df1 = pd.merge(env_df, plastic_waste1, how='inner', on='Entity')
env_df1

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate,"Plastic waste generation (tonnes, total)"
0,Afghanistan,9.438789,2019,0.000000,112000
1,Algeria,155.725261,2019,17.000600,1898343
2,Angola,34.537201,2019,-15.266103,528843
3,Antigua and Barbuda,0.565835,2019,-19.030663,22804
4,Argentina,195.531412,2019,-18.538234,2753550
...,...,...,...,...,...
150,Uruguay,6.943860,2019,151.729323,310379
151,Vanuatu,0.154614,2019,0.000000,25443
152,Venezuela,138.764602,2019,-10.965056,2669998
153,Vietnam,206.660895,2019,54.937137,3268227
154,Yemen,10.140644,2019,0.000000,887497

In [63]:
env_df2 = pd.merge(env_df1, particulate_pollution2, how='inner',on='Entity')
env_df2

,Entity,Annual CO2 emissions (ppm),Year,Deforestation Rate,"Plastic waste generation (tonnes, total)",PM2.5 air pollution(micrograms per cubic meter)
0,Afghanistan,9.438789,2019,0.000000,112000,62.854857
1,Algeria,155.725261,2019,17.000600,1898343,37.230956
2,Angola,34.537201,2019,-15.266103,528843,36.240479
3,Antigua and Barbuda,0.565835,2019,-19.030663,22804,15.685943
4,Argentina,195.531412,2019,-18.538234,2753550,14.148167
...,...,...,...,...,...,...
139,Uruguay,6.943860,2019,151.729323,310379,11.523398
140,Vanuatu,0.154614,2019,0.000000,25443,8.848735
141,Venezuela,138.764602,2019,-10.965056,2669998,26.331181
142,Vietnam,206.660895,2019,54.937137,3268227,26.285906
143,Yemen,10.140644,2019,0.000000,887497,72.553865

In [83]:
env_df3 = env_df2.rename(columns={'Entity':'Country'})
env_df3

,Country,Annual CO2 emissions (ppm),Year,Deforestation Rate,"Plastic waste generation (tonnes, total)",PM2.5 air pollution(micrograms per cubic meter)
0,Afghanistan,9.438789,2019,0.000000,112000,62.854857
1,Algeria,155.725261,2019,17.000600,1898343,37.230956
2,Angola,34.537201,2019,-15.266103,528843,36.240479
3,Antigua and Barbuda,0.565835,2019,-19.030663,22804,15.685943
4,Argentina,195.531412,2019,-18.538234,2753550,14.148167
...,...,...,...,...,...,...
139,Uruguay,6.943860,2019,151.729323,310379,11.523398
140,Vanuatu,0.154614,2019,0.000000,25443,8.848735
141,Venezuela,138.764602,2019,-10.965056,2669998,26.331181
142,Vietnam,206.660895,2019,54.937137,3268227,26.285906
143,Yemen,10.140644,2019,0.000000,887497,72.553865

# Agricultural Dataset

In [64]:
agriculture = pd.read_csv('Dataset/agriculturaldata/worldagriculturaldata.csv')
agriculture

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QC,Crops,2,Afghanistan,5419,Yield,56,Maize,2016,2016,hg/ha,20517,Fc,Calculated data
1,QC,Crops,2,Afghanistan,5419,Yield,27,Rice,2016,2016,hg/ha,29963,Fc,Calculated data
2,QC,Crops,2,Afghanistan,5419,Yield,15,Wheat,2016,2016,hg/ha,19803,Fc,Calculated data
3,QC,Crops,3,Albania,5419,Yield,56,Maize,2016,2016,hg/ha,64877,Fc,Calculated data
4,QC,Crops,3,Albania,5419,Yield,236,Soybeans,2016,2016,hg/ha,25152,Fc,Calculated data
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
565,QC,Crops,251,Zambia,5419,Yield,15,Wheat,2016,2016,hg/ha,66005,Fc,Calculated data
566,QC,Crops,181,Zimbabwe,5419,Yield,56,Maize,2016,2016,hg/ha,4405,Fc,Calculated data
567,QC,Crops,181,Zimbabwe,5419,Yield,27,Rice,2016,2016,hg/ha,22671,Fc,Calculated data
568,QC,Crops,181,Zimbabwe,5419,Yield,236,Soybeans,2016,2016,hg/ha,11958,Fc,Calculated data
569,QC,Crops,181,Zimbabwe,5419,Yield,15,Wheat,2016,2016,hg/ha,19013,Fc,Calculated data

In [65]:
# Concatenating the items
agriculture['Item'] = agriculture.groupby(['Area'])['Item'].transform(                                      
lambda x: ' '.join(x))

In [66]:
agriculture

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QC,Crops,2,Afghanistan,5419,Yield,56,Maize Rice Wheat,2016,2016,hg/ha,20517,Fc,Calculated data
1,QC,Crops,2,Afghanistan,5419,Yield,27,Maize Rice Wheat,2016,2016,hg/ha,29963,Fc,Calculated data
2,QC,Crops,2,Afghanistan,5419,Yield,15,Maize Rice Wheat,2016,2016,hg/ha,19803,Fc,Calculated data
3,QC,Crops,3,Albania,5419,Yield,56,Maize Soybeans Wheat,2016,2016,hg/ha,64877,Fc,Calculated data
4,QC,Crops,3,Albania,5419,Yield,236,Maize Soybeans Wheat,2016,2016,hg/ha,25152,Fc,Calculated data
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
565,QC,Crops,251,Zambia,5419,Yield,15,Maize Rice Soybeans Wheat,2016,2016,hg/ha,66005,Fc,Calculated data
566,QC,Crops,181,Zimbabwe,5419,Yield,56,Maize Rice Soybeans Wheat,2016,2016,hg/ha,4405,Fc,Calculated data
567,QC,Crops,181,Zimbabwe,5419,Yield,27,Maize Rice Soybeans Wheat,2016,2016,hg/ha,22671,Fc,Calculated data
568,QC,Crops,181,Zimbabwe,5419,Yield,236,Maize Rice Soybeans Wheat,2016,2016,hg/ha,11958,Fc,Calculated data
569,QC,Crops,181,Zimbabwe,5419,Yield,15,Maize Rice Soybeans Wheat,2016,2016,hg/ha,19013,Fc,Calculated data

In [67]:
# Creating a list of countries to iterate over
area_list = agriculture['Area'].tolist()
area_list1 = list(dict.fromkeys(area_list))
area_list1

['Afghanistan',
 'Albania',
 'Algeria',
 'American Samoa',
 'Angola',
 'Antigua and Barbuda',
 'Argentina',
 'Armenia',
 'Australia',
 'Austria',
 'Azerbaijan',
 'Bahamas',
 'Bangladesh',
 'Barbados',
 'Belarus',
 'Belgium',
 'Belize',
 'Benin',
 'Bhutan',
 'Bolivia',
 'Bosnia',
 'Brazil',
 'Brunei',
 'Bulgaria',
 'Burkina Faso',
 'Burundi',
 'Cabo Verde',
 'Cambodia',
 'Cameroon',
 'Canada',
 'Cayman Islands',
 'Central African Republic',
 'Chad',
 'Chile',
 'China',
 'Hong Kong',
 'Taiwan',
 'Colombia',
 'Comoros',
 'Congo',
 'Costa Rica',
 "Côte d'Ivoire",
 'Croatia',
 'Cuba',
 'Cyprus',
 'Czechia',
 'North Korea',
 'Democratic Republic of the Congo',
 'Denmark',
 'Djibouti',
 'Dominica',
 'Dominican Republic',
 'Ecuador',
 'Egypt',
 'El Salvador',
 'Eritrea',
 'Estonia',
 'Eswatini',
 'Ethiopia',
 'Fiji',
 'Finland',
 'France',
 'French Guyana',
 'Gabon',
 'Gambia',
 'Georgia',
 'Germany',
 'Ghana',
 'Greece',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Guatemala',
 'Guinea',
 'Guinea-Bissau',
 'Guyana',
 'Haiti',
 'Honduras',
 'Hungary',
 'India',
 'Indonesia',
 'Iran',
 'Iraq',
 'Ireland',
 'Israel',
 'Italy',
 'Jamaica',
 'Japan',
 'Jordan',
 'Kazakhstan',
 'Kenya',
 'Kuwait',
 'Kyrgyzstan',
 'Laos',
 'Latvia',
 'Lebanon',
 'Lesotho',
 'Liberia',
 'Libya',
 'Lithuania',
 'Luxembourg',
 'Madagascar',
 'Malawi',
 'Malaysia',
 'Maldives',
 'Mali',
 'Malta',
 'Martinique',
 'Mauritania',
 'Mauritius',
 'Mexico',
 'Micronesia',
 'Mongolia',
 'Montenegro',
 'Montserrat',
 'Morocco',
 'Mozambique',
 'Myanmar',
 'Namibia',
 'Nepal',
 'Netherlands',
 'New Caledonia',
 'New Zealand',
 'Nicaragua',
 'Niger',
 'Nigeria',
 'Niue',
 'North Macedonia',
 'Norway',
 'Oman',
 'Pakistan',
 'Palestine',
 'Panama',
 'Papua New Guinea',
 'Paraguay',
 'Peru',
 'Philippines',
 'Poland',
 'Portugal',
 'Puerto Rico',
 'Qatar',
 'South Korea',
 'Republic of Moldova',
 'Réunion',
 'Romania',
 'Russia',
 'Rwanda',
 'Saint Lucia',
 'Saint Vincent',
 'Samoa',
 'Sao Tome and Principe',
 'Saudi Arabia',
 'Senegal',
 'Serbia',
 'Sierra Leone',
 'Slovakia',
 'Slovenia',
 'Solomon Islands',
 'Somalia',
 'South Africa',
 'South Sudan',
 'Spain',
 'Sri Lanka',
 'Sudan',
 'Suriname',
 'Sweden',
 'Switzerland',
 'Syria',
 'Tajikistan',
 'Thailand',
 'Timor',
 'Togo',
 'Tonga',
 'Trinidad and Tobago',
 'Tunisia',
 'Turkey',
 'Turkmenistan',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom',
 'Tanzania',
 'United States',
 'Uruguay',
 'Uzbekistan',
 'Vanuatu',
 'Venezuela',
 'Viet Nam',
 'Wallis and Futuna Islands',
 'Yemen',
 'Zambia',
 'Zimbabwe']

In [68]:
# Iterating through the dataframe to obtain total staple crop yield

country_item = []
crop_output = []


for country in area_list1:

    crop_yeild = agriculture[agriculture['Area']==country]['Value'].sum()
    crops = agriculture['Item']
        
    print(f'{country}\n Staple Crop Yeild {crop_yeild}')

    country_item.append(country)
    crop_output.append(crop_yeild)

Afghanistan
 Staple Crop Yeild 70283
Albania
 Staple Crop Yeild 129029
Algeria
 Staple Crop Yeild 76438
American Samoa
 Staple Crop Yeild 35941
Angola
 Staple Crop Yeild 31962
Antigua and Barbuda
 Staple Crop Yeild 48045
Argentina
 Staple Crop Yeild 200828
Armenia
 Staple Crop Yeild 96336
Australia
 Staple Crop Yeild 216760
Austria
 Staple Crop Yeild 204811
Azerbaijan
 Staple Crop Yeild 120472
Bahamas
 Staple Crop Yeild 87327
Bangladesh
 Staple Crop Yeild 167508
Barbados
 Staple Crop Yeild 145004
Belarus
 Staple Crop Yeild 92557
Belgium
 Staple Crop Yeild 160139
Belize
 Staple Crop Yeild 192691
Benin
 Staple Crop Yeild 206058
Bhutan
 Staple Crop Yeild 102874
Bolivia
 Staple Crop Yeild 88115
Bosnia
 Staple Crop Yeild 133118
Brazil
 Staple Crop Yeild 255253
Brunei
 Staple Crop Yeild 15584
Bulgaria
 Staple Crop Yeild 169141
Burkina Faso
 Staple Crop Yeild 111192
Burundi
 Staple Crop Yeild 126906
Cabo Verde
 Staple Crop Yeild 1780
Cambodia
 Staple Crop Yeild 96915
Cameroon
 Staple Crop Yeild 168843
Canada
 Staple Crop Yeild 170765
Cayman Islands
 Staple Crop Yeild 33739
Central African Republic
 Staple Crop Yeild 105219
Chad
 Staple Crop Yeild 142627
Chile
 Staple Crop Yeild 241710
China
 Staple Crop Yeild 400546
Hong Kong
 Staple Crop Yeild 19902
Taiwan
 Staple Crop Yeild 154253
Colombia
 Staple Crop Yeild 226117
Comoros
 Staple Crop Yeild 87414
Congo
 Staple Crop Yeild 60811
Costa Rica
 Staple Crop Yeild 211815
Côte d'Ivoire
 Staple Crop Yeild 121202
Croatia
 Staple Crop Yeild 173054
Cuba
 Staple Crop Yeild 117754
Cyprus
 Staple Crop Yeild 8230
Czechia
 Staple Crop Yeild 189210
North Korea
 Staple Crop Yeild 119194
Democratic Republic of the Congo
 Staple Crop Yeild 76490
Denmark
 Staple Crop Yeild 148909
Djibouti
 Staple Crop Yeild 20503
Dominica
 Staple Crop Yeild 133487
Dominican Republic
 Staple Crop Yeild 117025
Ecuador
 Staple Crop Yeild 108702
Egypt
 Staple Crop Yeild 269276
El Salvador
 Staple Crop Yeild 118223
Eritrea
 Staple Crop Yeild 20000
Estonia
 Staple Crop Yeild 27685
Eswatini
 Staple Crop Yeild 62065
Ethiopia
 Staple Crop Yeild 413763
Fiji
 Staple Crop Yeild 210000
Finland
 Staple Crop Yeild 38303
France
 Staple Crop Yeild 207830
French Guyana
 Staple Crop Yeild 71059
Gabon
 Staple Crop Yeild 110412
Gambia
 Staple Crop Yeild 17732
Georgia
 Staple Crop Yeild 84469
Germany
 Staple Crop Yeild 199796
Ghana
 Staple Crop Yeild 233985
Greece
 Staple Crop Yeild 257598
Grenada
 Staple Crop Yeild 29919
Guadeloupe
 Staple Crop Yeild 139258
Guam
 Staple Crop Yeild 26319
Guatemala
 Staple Crop Yeild 97950
Guinea
 Staple Crop Yeild 106747
Guinea-Bissau
 Staple Crop Yeild 24885
Guyana
 Staple Crop Yeild 105635
Haiti
 Staple Crop Yeild 128066
Honduras
 Staple Crop Yeild 80955
Hungary
 Staple Crop Yeild 207248
India
 Staple Crop Yeild 106173
Indonesia
 Staple Crop Yeild 120309
Iran
 Staple Crop Yeild 174044
Iraq
 Staple Crop Yeild 128143
Ireland
 Staple Crop Yeild 95390
Israel
 Staple Crop Yeild 268427
Italy
 Staple Crop Yeild 250881
Jamaica
 Staple Crop Yeild 226735
Japan
 Staple Crop Yeild 351772
Jordan
 Staple Crop Yeild 361699
Kazakhstan
 Staple Crop Yeild 137802
Kenya
 Staple Crop Yeild 169665
Kuwait
 Staple Crop Yeild 95533
Kyrgyzstan
 Staple Crop Yeild 135428
Laos
 Staple Crop Yeild 118432
Latvia
 Staple Crop Yeild 43045
Lebanon
 Staple Crop Yeild 72217
Lesotho
 Staple Crop Yeild 10617
Liberia
 Staple Crop Yeild 101967
Libya
 Staple Crop Yeild 29766
Lithuania
 Staple Crop Yeild 113058
Luxembourg
 Staple Crop Yeild 117714
Madagascar
 Staple Crop Yeild 88220
Malawi
 Staple Crop Yeild 49720
Malaysia
 Staple Crop Yeild 104371
Maldives
 Staple Crop Yeild 50317
Mali
 Staple Crop Yeild 351567
Malta
 Staple Crop Yeild 49826
Martinique
 Staple Crop Yeild 10056
Mauritania
 Staple Crop Yeild 143457
Mauritius
 Staple Crop Yeild 89896
Mexico
 Staple Crop Yeild 170241
Micronesia
 Staple Crop Yeild 32937
Mongolia
 Staple Crop Yeild 13154
Montenegro
 Staple Crop Yeild 73695
Montserrat
 Staple Crop Yeild 70195
Morocco
 Staple Crop Yeild 101471
Mozambique
 Staple Crop Yeild 25897
Myanmar
 Staple Crop Yeild 97977
Namibia
 Staple Crop Yeild 66802
Nepal
 Staple Crop Yeild 92193
Netherlands
 Staple Crop Yeild 180308
New Caledonia
 Staple Crop Yeild 108164
New Zealand
 Staple Crop Yeild 208864
Nicaragua
 Staple Crop Yeild 224853
Niger
 Staple Crop Yeild 76669
Nigeria
 Staple Crop Yeild 142617
Niue
 Staple Crop Yeild 11252
North Macedonia
 Staple Crop Yeild 143841
Norway
 Staple Crop Yeild 46339
Oman
 Staple Crop Yeild 110925
Pakistan
 Staple Crop Yeild 119508
Palestine
 Staple Crop Yeild 25715
Panama
 Staple Crop Yeild 101520
Papua New Guinea
 Staple Crop Yeild 249274
Paraguay
 Staple Crop Yeild 168860
Peru
 Staple Crop Yeild 140297
Philippines
 Staple Crop Yeild 135952
Poland
 Staple Crop Yeild 138272
Portugal
 Staple Crop Yeild 332402
Puerto Rico
 Staple Crop Yeild 115280
Qatar
 Staple Crop Yeild 147974
South Korea
 Staple Crop Yeild 173224
Republic of Moldova
 Staple Crop Yeild 76470
Réunion
 Staple Crop Yeild 125588
Romania
 Staple Crop Yeild 148454
Russia
 Staple Crop Yeild 149738
Rwanda
 Staple Crop Yeild 163424
Saint Lucia
 Staple Crop Yeild 36813
Saint Vincent
 Staple Crop Yeild 375321
Samoa
 Staple Crop Yeild 36489
Sao Tome and Principe
 Staple Crop Yeild 79021
Saudi Arabia
 Staple Crop Yeild 119209
Senegal
 Staple Crop Yeild 55347
Serbia
 Staple Crop Yeild 153110
Sierra Leone
 Staple Crop Yeild 14769
Slovakia
 Staple Crop Yeild 177492
Slovenia
 Staple Crop Yeild 176962
Solomon Islands
 Staple Crop Yeild 120771
Somalia
 Staple Crop Yeild 28156
South Africa
 Staple Crop Yeild 119683
South Sudan
 Staple Crop Yeild 29295
Spain
 Staple Crop Yeild 253437
Sri Lanka
 Staple Crop Yeild 90402
Sudan
 Staple Crop Yeild 98111
Suriname
 Staple Crop Yeild 79063
Sweden
 Staple Crop Yeild 63204
Switzerland
 Staple Crop Yeild 171139
Syria
 Staple Crop Yeild 73310
Tajikistan
 Staple Crop Yeild 228380
Thailand
 Staple Crop Yeild 99609
Timor
 Staple Crop Yeild 65649
Togo
 Staple Crop Yeild 122534
Tonga
 Staple Crop Yeild 136683
Trinidad and Tobago
 Staple Crop Yeild 61832
Tunisia
 Staple Crop Yeild 18227
Turkey
 Staple Crop Yeild 243743
Turkmenistan
 Staple Crop Yeild 35288
Uganda
 Staple Crop Yeild 70334
Ukraine
 Staple Crop Yeild 184999
United Arab Emirates
 Staple Crop Yeild 333965
United Kingdom
 Staple Crop Yeild 78897
Tanzania
 Staple Crop Yeild 123253
United States
 Staple Crop Yeild 268898
Uruguay
 Staple Crop Yeild 207752
Uzbekistan
 Staple Crop Yeild 253296
Vanuatu
 Staple Crop Yeild 6082
Venezuela
 Staple Crop Yeild 209935
Viet Nam
 Staple Crop Yeild 117405
Wallis and Futuna Islands
 Staple Crop Yeild 91657
Yemen
 Staple Crop Yeild 26544
Zambia
 Staple Crop Yeild 122307
Zimbabwe
 Staple Crop Yeild 58047

In [69]:
agriculture1 = pd.DataFrame({
    'Area':country_item,
    'Crop Yeild (kg/ha)':crop_output,
    
})

agriculture1

                          Area  Crop Yeild (kg/ha)
0                  Afghanistan               70283
1                      Albania              129029
2                      Algeria               76438
3               American Samoa               35941
4                       Angola               31962
..                         ...                 ...
187                   Viet Nam              117405
188  Wallis and Futuna Islands               91657
189                      Yemen               26544
190                     Zambia              122307
191                   Zimbabwe               58047

[192 rows x 2 columns]

In [70]:
# New dataframe
agriculture2 = pd.merge(agriculture, agriculture1, how='inner', on='Area')
agriculture2

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Crop Yeild (kg/ha)
0,QC,Crops,2,Afghanistan,5419,Yield,56,Maize Rice Wheat,2016,2016,hg/ha,20517,Fc,Calculated data,70283
1,QC,Crops,2,Afghanistan,5419,Yield,27,Maize Rice Wheat,2016,2016,hg/ha,29963,Fc,Calculated data,70283
2,QC,Crops,2,Afghanistan,5419,Yield,15,Maize Rice Wheat,2016,2016,hg/ha,19803,Fc,Calculated data,70283
3,QC,Crops,3,Albania,5419,Yield,56,Maize Soybeans Wheat,2016,2016,hg/ha,64877,Fc,Calculated data,129029
4,QC,Crops,3,Albania,5419,Yield,236,Maize Soybeans Wheat,2016,2016,hg/ha,25152,Fc,Calculated data,129029
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
565,QC,Crops,251,Zambia,5419,Yield,15,Maize Rice Soybeans Wheat,2016,2016,hg/ha,66005,Fc,Calculated data,122307
566,QC,Crops,181,Zimbabwe,5419,Yield,56,Maize Rice Soybeans Wheat,2016,2016,hg/ha,4405,Fc,Calculated data,58047
567,QC,Crops,181,Zimbabwe,5419,Yield,27,Maize Rice Soybeans Wheat,2016,2016,hg/ha,22671,Fc,Calculated data,58047
568,QC,Crops,181,Zimbabwe,5419,Yield,236,Maize Rice Soybeans Wheat,2016,2016,hg/ha,11958,Fc,Calculated data,58047
569,QC,Crops,181,Zimbabwe,5419,Yield,15,Maize Rice Soybeans Wheat,2016,2016,hg/ha,19013,Fc,Calculated data,58047

In [71]:
agriculture2.columns

Index(['Domain Code', 'Domain', 'Area Code', 'Area', 'Element Code', 'Element',
       'Item Code', 'Item', 'Year Code', 'Year', 'Unit', 'Value', 'Flag',
       'Flag Description', 'Crop Yeild (kg/ha)'],
      dtype='object')

In [72]:
agriculture3 = agriculture2.drop(columns=['Domain Code', 'Domain', 'Area Code','Element Code', 'Element',
       'Item Code','Year Code', 'Year', 'Unit', 'Value', 'Flag',
       'Flag Description' ])

agriculture3

            Area                       Item  Crop Yeild (kg/ha)
0    Afghanistan           Maize Rice Wheat               70283
1    Afghanistan           Maize Rice Wheat               70283
2    Afghanistan           Maize Rice Wheat               70283
3        Albania       Maize Soybeans Wheat              129029
4        Albania       Maize Soybeans Wheat              129029
..           ...                        ...                 ...
565       Zambia  Maize Rice Soybeans Wheat              122307
566     Zimbabwe  Maize Rice Soybeans Wheat               58047
567     Zimbabwe  Maize Rice Soybeans Wheat               58047
568     Zimbabwe  Maize Rice Soybeans Wheat               58047
569     Zimbabwe  Maize Rice Soybeans Wheat               58047

[570 rows x 3 columns]

In [85]:
agriculture4 = agriculture3.drop_duplicates()
agriculture5 = agriculture4.rename(columns={'Area':'Entity'})

In [74]:
# Employment in Agriculture
agri_employment = pd.read_csv('Dataset/agriculturaldata/agriculture-value-added-per-worker-wdi.csv')
agri_employment

,Entity,Code,Year,"Agriculture, value added per worker (constant 2010 US$)"
0,Afghanistan,AFG,2002,872.846684
1,Afghanistan,AFG,2003,856.625361
2,Afghanistan,AFG,2004,657.038803
3,Afghanistan,AFG,2005,724.391297
4,Afghanistan,AFG,2006,686.918524
...,...,...,...,...
5228,Zimbabwe,ZWE,2013,269.582684
5229,Zimbabwe,ZWE,2014,317.117440
5230,Zimbabwe,ZWE,2015,293.152050
5231,Zimbabwe,ZWE,2016,274.353843
5232,Zimbabwe,ZWE,2017,300.529041

In [75]:
# Obtaining the latest information
agri_employment1 = agri_employment[agri_employment['Year']==2015]
agri_employment1

,Entity,Code,Year,"Agriculture, value added per worker (constant 2010 US$)"
13,Afghanistan,AFG,2015,761.461513
39,Albania,ALB,2015,5374.476370
66,Algeria,DZA,2015,14065.123850
93,Arab World,NaN,2015,5215.818543
119,Argentina,ARG,2015,338735.911200
...,...,...,...,...
5124,Vietnam,VNM,2015,1023.036173
5151,World,OWID_WRL,2015,3430.940120
5177,Yemen,YEM,2015,873.961738
5203,Zambia,ZMB,2015,584.557209
5230,Zimbabwe,ZWE,2015,293.152050

In [77]:
# Agri employment in Urban setting
agri_emp_urban = pd.read_csv('Dataset/agriculturaldata/employment-in-agri-vs-urban-pop.csv')
agri_emp_urban

,Entity,Code,Year,"Total population (Gapminder, HYDE & UN)",Continent,Urban population (% of total),Employment in agriculture (% of total employment) (modeled ILO estimate)
0,Abkhazia,OWID_ABK,2015,NaN,Asia,NaN,NaN
1,Afghanistan,AFG,1800,3280000.0,NaN,NaN,NaN
2,Afghanistan,AFG,1801,3280000.0,NaN,NaN,NaN
3,Afghanistan,AFG,1802,3280000.0,NaN,NaN,NaN
4,Afghanistan,AFG,1803,3280000.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
49539,Zimbabwe,ZWE,2016,14030000.0,NaN,32.296,67.430000
49540,Zimbabwe,ZWE,2017,14237000.0,NaN,32.237,68.455002
49541,Zimbabwe,ZWE,2018,14439000.0,NaN,NaN,NaN
49542,Zimbabwe,ZWE,2019,14645000.0,NaN,NaN,NaN
49543,Åland Islands,ALA,2015,NaN,Europe,NaN,NaN

In [78]:
# Obtaining the latest data
agri_emp_urban1 = agri_emp_urban[agri_emp_urban['Year']==2015]
agri_emp_urban1

,Entity,Code,Year,"Total population (Gapminder, HYDE & UN)",Continent,Urban population (% of total),Employment in agriculture (% of total employment) (modeled ILO estimate)
0,Abkhazia,OWID_ABK,2015,NaN,Asia,NaN,NaN
216,Afghanistan,AFG,2015,3.441400e+07,Asia,24.803,61.132000
338,Africa,NaN,2015,1.182439e+09,NaN,NaN,NaN
343,Akrotiri and Dhekelia,OWID_AKD,2015,NaN,Asia,NaN,NaN
559,Albania,ALB,2015,2.891000e+06,Europe,57.434,41.366001
...,...,...,...,...,...,...,...
49101,Yugoslavia,OWID_YGS,2015,NaN,Europe,NaN,NaN
49317,Zambia,ZMB,2015,1.587900e+07,Africa,41.907,53.666000
49322,Zanzibar,OWID_ZAN,2015,NaN,Africa,NaN,NaN
49538,Zimbabwe,ZWE,2015,1.381500e+07,Africa,32.385,67.209999
49543,Åland Islands,ALA,2015,NaN,Europe,NaN,NaN

In [79]:
agri_emp_urban2 = agri_emp_urban1.dropna(inplace=False)
agri_emp_urban2

,Entity,Code,Year,"Total population (Gapminder, HYDE & UN)",Continent,Urban population (% of total),Employment in agriculture (% of total employment) (modeled ILO estimate)
216,Afghanistan,AFG,2015,34414000.0,Asia,24.803,61.132000
559,Albania,ALB,2015,2891000.0,Europe,57.434,41.366001
779,Algeria,DZA,2015,39728000.0,Africa,70.848,13.075000
1289,Angola,AGO,2015,27884000.0,Africa,63.446,48.896000
1858,Argentina,ARG,2015,43075000.0,South America,91.503,0.518000
...,...,...,...,...,...,...,...
48361,Venezuela,VEN,2015,30082000.0,South America,88.154,9.076000
48581,Vietnam,VNM,2015,92677000.0,Asia,33.809,43.931999
49094,Yemen,YEM,2015,26498000.0,Asia,34.777,34.674999
49317,Zambia,ZMB,2015,15879000.0,Africa,41.907,53.666000
49538,Zimbabwe,ZWE,2015,13815000.0,Africa,32.385,67.209999

In [80]:
agri_emp_urban2.columns

Index(['Entity', 'Code', 'Year', 'Total population (Gapminder, HYDE & UN)',
       'Continent', 'Urban population (% of total)',
       'Employment in agriculture (% of total employment) (modeled ILO estimate)'],
      dtype='object')

In [82]:
agri_emp_urban3 = agri_emp_urban2.drop(columns=['Code', 'Year', 'Total population (Gapminder, HYDE & UN)',
       'Continent']).rename(columns={'Urban population (% of total)':'Urban Population (%)','Employment in agriculture (% of total employment) (modeled ILO estimate)':'Employed in Agriculture(%)'})

agri_emp_urban3

            Entity  Urban Population (%)  Employed in Agriculture(%)
216    Afghanistan                24.803                   61.132000
559        Albania                57.434                   41.366001
779        Algeria                70.848                   13.075000
1289        Angola                63.446                   48.896000
1858     Argentina                91.503                    0.518000
...            ...                   ...                         ...
48361    Venezuela                88.154                    9.076000
48581      Vietnam                33.809                   43.931999
49094        Yemen                34.777                   34.674999
49317       Zambia                41.907                   53.666000
49538     Zimbabwe                32.385                   67.209999

[185 rows x 3 columns]

In [86]:
# Merging the datasets
agrimerge = pd.merge(agriculture5,agri_employment1, on='Entity',how='inner')
agrimerge

,Entity,Item,Crop Yeild (kg/ha),Code,Year,"Agriculture, value added per worker (constant 2010 US$)"
0,Afghanistan,Maize Rice Wheat,70283,AFG,2015,761.461513
1,Albania,Maize Soybeans Wheat,129029,ALB,2015,5374.476370
2,Algeria,Maize Rice Wheat,76438,DZA,2015,14065.123850
3,Argentina,Maize Rice Soybeans Wheat,200828,ARG,2015,338735.911200
4,Armenia,Maize Wheat,96336,ARM,2015,6289.041997
...,...,...,...,...,...,...
148,Uruguay,Maize Rice Soybeans Wheat,207752,URY,2015,23018.482870
149,Uzbekistan,Maize Rice Soybeans Wheat,253296,UZB,2015,3179.070812
150,Yemen,Maize Wheat,26544,YEM,2015,873.961738
151,Zambia,Maize Rice Soybeans Wheat,122307,ZMB,2015,584.557209
152,Zimbabwe,Maize Rice Soybeans Wheat,58047,ZWE,2015,293.152050

In [87]:
agrimerge1 = pd.merge(agrimerge,agri_emp_urban3, on='Entity', how='inner')
agrimerge1

,Entity,Item,Crop Yeild (kg/ha),Code,Year,"Agriculture, value added per worker (constant 2010 US$)",Urban Population (%),Employed in Agriculture(%)
0,Afghanistan,Maize Rice Wheat,70283,AFG,2015,761.461513,24.803,61.132000
1,Albania,Maize Soybeans Wheat,129029,ALB,2015,5374.476370,57.434,41.366001
2,Algeria,Maize Rice Wheat,76438,DZA,2015,14065.123850,70.848,13.075000
3,Argentina,Maize Rice Soybeans Wheat,200828,ARG,2015,338735.911200,91.503,0.518000
4,Armenia,Maize Wheat,96336,ARM,2015,6289.041997,63.085,35.328999
...,...,...,...,...,...,...,...,...
148,Uruguay,Maize Rice Soybeans Wheat,207752,URY,2015,23018.482870,95.045,8.824000
149,Uzbekistan,Maize Rice Soybeans Wheat,253296,UZB,2015,3179.070812,50.750,22.846001
150,Yemen,Maize Wheat,26544,YEM,2015,873.961738,34.777,34.674999
151,Zambia,Maize Rice Soybeans Wheat,122307,ZMB,2015,584.557209,41.907,53.666000
152,Zimbabwe,Maize Rice Soybeans Wheat,58047,ZWE,2015,293.152050,32.385,67.209999

In [89]:
agrimerge2 = agrimerge1.drop(columns=['Code','Year'])
agrimerge2

,Entity,Item,Crop Yeild (kg/ha),"Agriculture, value added per worker (constant 2010 US$)",Urban Population (%),Employed in Agriculture(%)
0,Afghanistan,Maize Rice Wheat,70283,761.461513,24.803,61.132000
1,Albania,Maize Soybeans Wheat,129029,5374.476370,57.434,41.366001
2,Algeria,Maize Rice Wheat,76438,14065.123850,70.848,13.075000
3,Argentina,Maize Rice Soybeans Wheat,200828,338735.911200,91.503,0.518000
4,Armenia,Maize Wheat,96336,6289.041997,63.085,35.328999
...,...,...,...,...,...,...
148,Uruguay,Maize Rice Soybeans Wheat,207752,23018.482870,95.045,8.824000
149,Uzbekistan,Maize Rice Soybeans Wheat,253296,3179.070812,50.750,22.846001
150,Yemen,Maize Wheat,26544,873.961738,34.777,34.674999
151,Zambia,Maize Rice Soybeans Wheat,122307,584.557209,41.907,53.666000
152,Zimbabwe,Maize Rice Soybeans Wheat,58047,293.152050,32.385,67.209999

In [94]:
# Cashcrops
cashcrops = pd.read_csv('Dataset/agriculturaldata/cashcrops.csv')
cashcrops

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QC,Crops,2,Afghanistan,5419,Yield,328,Cotton,2018,2018,hg/ha,10000,Fc,Calculated data
1,QC,Crops,3,Albania,5419,Yield,328,Cotton,2018,2018,hg/ha,11081,Fc,Calculated data
2,QC,Crops,3,Albania,5419,Yield,826,Tobacco,2018,2018,hg/ha,16863,Fc,Calculated data
3,QC,Crops,4,Algeria,5419,Yield,328,Cotton,2018,2018,hg/ha,3077,Fc,Calculated data
4,QC,Crops,4,Algeria,5419,Yield,826,Tobacco,2018,2018,hg/ha,20967,Fc,Calculated data
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
403,QC,Crops,251,Zambia,5419,Yield,826,Tobacco,2018,2018,hg/ha,17659,Fc,Calculated data
404,QC,Crops,181,Zimbabwe,5419,Yield,656,Coffee,2018,2018,hg/ha,2419,Fc,Calculated data
405,QC,Crops,181,Zimbabwe,5419,Yield,328,Cotton,2018,2018,hg/ha,5625,Fc,Calculated data
406,QC,Crops,181,Zimbabwe,5419,Yield,667,Tea,2018,2018,hg/ha,34722,Fc,Calculated data
407,QC,Crops,181,Zimbabwe,5419,Yield,826,Tobacco,2018,2018,hg/ha,13114,Fc,Calculated data

In [95]:
cashcrops['Item'] = cashcrops.groupby(['Area'])['Item'].transform(
lambda x: ' '.join(x))

In [96]:
cashcrops

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QC,Crops,2,Afghanistan,5419,Yield,328,Cotton,2018,2018,hg/ha,10000,Fc,Calculated data
1,QC,Crops,3,Albania,5419,Yield,328,Cotton Tobacco,2018,2018,hg/ha,11081,Fc,Calculated data
2,QC,Crops,3,Albania,5419,Yield,826,Cotton Tobacco,2018,2018,hg/ha,16863,Fc,Calculated data
3,QC,Crops,4,Algeria,5419,Yield,328,Cotton Tobacco,2018,2018,hg/ha,3077,Fc,Calculated data
4,QC,Crops,4,Algeria,5419,Yield,826,Cotton Tobacco,2018,2018,hg/ha,20967,Fc,Calculated data
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
403,QC,Crops,251,Zambia,5419,Yield,826,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,17659,Fc,Calculated data
404,QC,Crops,181,Zimbabwe,5419,Yield,656,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,2419,Fc,Calculated data
405,QC,Crops,181,Zimbabwe,5419,Yield,328,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,5625,Fc,Calculated data
406,QC,Crops,181,Zimbabwe,5419,Yield,667,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,34722,Fc,Calculated data
407,QC,Crops,181,Zimbabwe,5419,Yield,826,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,13114,Fc,Calculated data

In [97]:
area_list2 = cashcrops['Area'].tolist()
area_list3 = list(dict.fromkeys(area_list))
area_list3

['Afghanistan',
 'Albania',
 'Algeria',
 'American Samoa',
 'Angola',
 'Antigua and Barbuda',
 'Argentina',
 'Armenia',
 'Australia',
 'Austria',
 'Azerbaijan',
 'Bahamas',
 'Bangladesh',
 'Barbados',
 'Belarus',
 'Belgium',
 'Belize',
 'Benin',
 'Bhutan',
 'Bolivia',
 'Bosnia',
 'Brazil',
 'Brunei',
 'Bulgaria',
 'Burkina Faso',
 'Burundi',
 'Cabo Verde',
 'Cambodia',
 'Cameroon',
 'Canada',
 'Cayman Islands',
 'Central African Republic',
 'Chad',
 'Chile',
 'China',
 'Hong Kong',
 'Taiwan',
 'Colombia',
 'Comoros',
 'Congo',
 'Costa Rica',
 "Côte d'Ivoire",
 'Croatia',
 'Cuba',
 'Cyprus',
 'Czechia',
 'North Korea',
 'Democratic Republic of the Congo',
 'Denmark',
 'Djibouti',
 'Dominica',
 'Dominican Republic',
 'Ecuador',
 'Egypt',
 'El Salvador',
 'Eritrea',
 'Estonia',
 'Eswatini',
 'Ethiopia',
 'Fiji',
 'Finland',
 'France',
 'French Guyana',
 'Gabon',
 'Gambia',
 'Georgia',
 'Germany',
 'Ghana',
 'Greece',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Guatemala',
 'Guinea',
 'Guinea-Bissau',
 'Guyana',
 'Haiti',
 'Honduras',
 'Hungary',
 'India',
 'Indonesia',
 'Iran',
 'Iraq',
 'Ireland',
 'Israel',
 'Italy',
 'Jamaica',
 'Japan',
 'Jordan',
 'Kazakhstan',
 'Kenya',
 'Kuwait',
 'Kyrgyzstan',
 'Laos',
 'Latvia',
 'Lebanon',
 'Lesotho',
 'Liberia',
 'Libya',
 'Lithuania',
 'Luxembourg',
 'Madagascar',
 'Malawi',
 'Malaysia',
 'Maldives',
 'Mali',
 'Malta',
 'Martinique',
 'Mauritania',
 'Mauritius',
 'Mexico',
 'Micronesia',
 'Mongolia',
 'Montenegro',
 'Montserrat',
 'Morocco',
 'Mozambique',
 'Myanmar',
 'Namibia',
 'Nepal',
 'Netherlands',
 'New Caledonia',
 'New Zealand',
 'Nicaragua',
 'Niger',
 'Nigeria',
 'Niue',
 'North Macedonia',
 'Norway',
 'Oman',
 'Pakistan',
 'Palestine',
 'Panama',
 'Papua New Guinea',
 'Paraguay',
 'Peru',
 'Philippines',
 'Poland',
 'Portugal',
 'Puerto Rico',
 'Qatar',
 'South Korea',
 'Republic of Moldova',
 'Réunion',
 'Romania',
 'Russia',
 'Rwanda',
 'Saint Lucia',
 'Saint Vincent',
 'Samoa',
 'Sao Tome and Principe',
 'Saudi Arabia',
 'Senegal',
 'Serbia',
 'Sierra Leone',
 'Slovakia',
 'Slovenia',
 'Solomon Islands',
 'Somalia',
 'South Africa',
 'South Sudan',
 'Spain',
 'Sri Lanka',
 'Sudan',
 'Suriname',
 'Sweden',
 'Switzerland',
 'Syria',
 'Tajikistan',
 'Thailand',
 'Timor',
 'Togo',
 'Tonga',
 'Trinidad and Tobago',
 'Tunisia',
 'Turkey',
 'Turkmenistan',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom',
 'Tanzania',
 'United States',
 'Uruguay',
 'Uzbekistan',
 'Vanuatu',
 'Venezuela',
 'Viet Nam',
 'Wallis and Futuna Islands',
 'Yemen',
 'Zambia',
 'Zimbabwe']

In [102]:
# Iterating through the dataframe to obtain total staple crop yield

country_item1 = []
crop_output1 = []


for country1 in area_list3:

    crop_yeild1 = cashcrops[cashcrops['Area']==country1]['Value'].sum()
    
        
    print(f'{country1}\n Cash Crop Yeild {crop_yeild1}')

    country_item1.append(country1)
    crop_output1.append(crop_yeild1)

Afghanistan
 Cash Crop Yeild 10000
Albania
 Cash Crop Yeild 27944
Algeria
 Cash Crop Yeild 24044
American Samoa
 Cash Crop Yeild 542
Angola
 Cash Crop Yeild 33265
Antigua and Barbuda
 Cash Crop Yeild 1750
Argentina
 Cash Crop Yeild 65207
Armenia
 Cash Crop Yeild 23257
Australia
 Cash Crop Yeild 78916
Austria
 Cash Crop Yeild 16781
Azerbaijan
 Cash Crop Yeild 49726
Bahamas
 Cash Crop Yeild 0
Bangladesh
 Cash Crop Yeild 69169
Barbados
 Cash Crop Yeild 0
Belarus
 Cash Crop Yeild 0
Belgium
 Cash Crop Yeild 28306
Belize
 Cash Crop Yeild 14865
Benin
 Cash Crop Yeild 21172
Bhutan
 Cash Crop Yeild 14957
Bolivia
 Cash Crop Yeild 77532
Bosnia
 Cash Crop Yeild 15270
Brazil
 Cash Crop Yeild 110575
Brunei
 Cash Crop Yeild 0
Bulgaria
 Cash Crop Yeild 22421
Burkina Faso
 Cash Crop Yeild 18982
Burundi
 Cash Crop Yeild 78317
Cabo Verde
 Cash Crop Yeild 2074
Cambodia
 Cash Crop Yeild 39673
Cameroon
 Cash Crop Yeild 60931
Canada
 Cash Crop Yeild 27662
Cayman Islands
 Cash Crop Yeild 0
Central African Republic
 Cash Crop Yeild 16932
Chad
 Cash Crop Yeild 22307
Chile
 Cash Crop Yeild 31200
China
 Cash Crop Yeild 231773
Hong Kong
 Cash Crop Yeild 0
Taiwan
 Cash Crop Yeild 36383
Colombia
 Cash Crop Yeild 95038
Comoros
 Cash Crop Yeild 4655
Congo
 Cash Crop Yeild 10333
Costa Rica
 Cash Crop Yeild 38488
Côte d'Ivoire
 Cash Crop Yeild 19969
Croatia
 Cash Crop Yeild 19721
Cuba
 Cash Crop Yeild 21786
Cyprus
 Cash Crop Yeild 43155
Czechia
 Cash Crop Yeild 0
North Korea
 Cash Crop Yeild 34536
Democratic Republic of the Congo
 Cash Crop Yeild 18940
Denmark
 Cash Crop Yeild 0
Djibouti
 Cash Crop Yeild 0
Dominica
 Cash Crop Yeild 5023
Dominican Republic
 Cash Crop Yeild 25185
Ecuador
 Cash Crop Yeild 56875
Egypt
 Cash Crop Yeild 22213
El Salvador
 Cash Crop Yeild 61684
Eritrea
 Cash Crop Yeild 0
Estonia
 Cash Crop Yeild 0
Eswatini
 Cash Crop Yeild 10832
Ethiopia
 Cash Crop Yeild 37881
Fiji
 Cash Crop Yeild 12777
Finland
 Cash Crop Yeild 0
France
 Cash Crop Yeild 26038
French Guyana
 Cash Crop Yeild 0
Gabon
 Cash Crop Yeild 4062
Gambia
 Cash Crop Yeild 3482
Georgia
 Cash Crop Yeild 13079
Germany
 Cash Crop Yeild 26106
Ghana
 Cash Crop Yeild 35708
Greece
 Cash Crop Yeild 45661
Grenada
 Cash Crop Yeild 9964
Guadeloupe
 Cash Crop Yeild 9765
Guam
 Cash Crop Yeild 0
Guatemala
 Cash Crop Yeild 92212
Guinea
 Cash Crop Yeild 31455
Guinea-Bissau
 Cash Crop Yeild 11308
Guyana
 Cash Crop Yeild 20012
Haiti
 Cash Crop Yeild 27359
Honduras
 Cash Crop Yeild 48858
Hungary
 Cash Crop Yeild 15597
India
 Cash Crop Yeild 60799
Indonesia
 Cash Crop Yeild 31549
Iran
 Cash Crop Yeild 102658
Iraq
 Cash Crop Yeild 28169
Ireland
 Cash Crop Yeild 0
Israel
 Cash Crop Yeild 38948
Italy
 Cash Crop Yeild 34523
Jamaica
 Cash Crop Yeild 33063
Japan
 Cash Crop Yeild 43437
Jordan
 Cash Crop Yeild 14679
Kazakhstan
 Cash Crop Yeild 57625
Kenya
 Cash Crop Yeild 34163
Kuwait
 Cash Crop Yeild 0
Kyrgyzstan
 Cash Crop Yeild 57667
Laos
 Cash Crop Yeild 164866
Latvia
 Cash Crop Yeild 0
Lebanon
 Cash Crop Yeild 11638
Lesotho
 Cash Crop Yeild 0
Liberia
 Cash Crop Yeild 3921
Libya
 Cash Crop Yeild 20574
Lithuania
 Cash Crop Yeild 0
Luxembourg
 Cash Crop Yeild 0
Madagascar
 Cash Crop Yeild 36071
Malawi
 Cash Crop Yeild 66961
Malaysia
 Cash Crop Yeild 103266
Maldives
 Cash Crop Yeild 0
Mali
 Cash Crop Yeild 48248
Malta
 Cash Crop Yeild 0
Martinique
 Cash Crop Yeild 9824
Mauritania
 Cash Crop Yeild 0
Mauritius
 Cash Crop Yeild 39080
Mexico
 Cash Crop Yeild 78875
Micronesia
 Cash Crop Yeild 3855
Mongolia
 Cash Crop Yeild 0
Montenegro
 Cash Crop Yeild 27912
Montserrat
 Cash Crop Yeild 9429
Morocco
 Cash Crop Yeild 50700
Mozambique
 Cash Crop Yeild 43713
Myanmar
 Cash Crop Yeild 57748
Namibia
 Cash Crop Yeild 0
Nepal
 Cash Crop Yeild 31650
Netherlands
 Cash Crop Yeild 0
New Caledonia
 Cash Crop Yeild 1360
New Zealand
 Cash Crop Yeild 0
Nicaragua
 Cash Crop Yeild 58009
Niger
 Cash Crop Yeild 27766
Nigeria
 Cash Crop Yeild 29916
Niue
 Cash Crop Yeild 0
North Macedonia
 Cash Crop Yeild 15406
Norway
 Cash Crop Yeild 0
Oman
 Cash Crop Yeild 45448
Pakistan
 Cash Crop Yeild 43384
Palestine
 Cash Crop Yeild 7019
Panama
 Cash Crop Yeild 24149
Papua New Guinea
 Cash Crop Yeild 28880
Paraguay
 Cash Crop Yeild 54781
Peru
 Cash Crop Yeild 147204
Philippines
 Cash Crop Yeild 29620
Poland
 Cash Crop Yeild 20251
Portugal
 Cash Crop Yeild 69243
Puerto Rico
 Cash Crop Yeild 16072
Qatar
 Cash Crop Yeild 0
South Korea
 Cash Crop Yeild 35385
Republic of Moldova
 Cash Crop Yeild 18907
Réunion
 Cash Crop Yeild 23792
Romania
 Cash Crop Yeild 13745
Russia
 Cash Crop Yeild 20485
Rwanda
 Cash Crop Yeild 30815
Saint Lucia
 Cash Crop Yeild 16530
Saint Vincent
 Cash Crop Yeild 0
Samoa
 Cash Crop Yeild 55836
Sao Tome and Principe
 Cash Crop Yeild 1429
Saudi Arabia
 Cash Crop Yeild 0
Senegal
 Cash Crop Yeild 11153
Serbia
 Cash Crop Yeild 12442
Sierra Leone
 Cash Crop Yeild 30477
Slovakia
 Cash Crop Yeild 4286
Slovenia
 Cash Crop Yeild 0
Solomon Islands
 Cash Crop Yeild 12685
Somalia
 Cash Crop Yeild 8173
South Africa
 Cash Crop Yeild 79091
South Sudan
 Cash Crop Yeild 0
Spain
 Cash Crop Yeild 54491
Sri Lanka
 Cash Crop Yeild 98102
Sudan
 Cash Crop Yeild 19512
Suriname
 Cash Crop Yeild 534
Sweden
 Cash Crop Yeild 0
Switzerland
 Cash Crop Yeild 20801
Syria
 Cash Crop Yeild 19895
Tajikistan
 Cash Crop Yeild 30517
Thailand
 Cash Crop Yeild 132969
Timor
 Cash Crop Yeild 2868
Togo
 Cash Crop Yeild 24180
Tonga
 Cash Crop Yeild 14498
Trinidad and Tobago
 Cash Crop Yeild 21638
Tunisia
 Cash Crop Yeild 20037
Turkey
 Cash Crop Yeild 90475
Turkmenistan
 Cash Crop Yeild 33340
Uganda
 Cash Crop Yeild 59356
Ukraine
 Cash Crop Yeild 25800
United Arab Emirates
 Cash Crop Yeild 138242
United Kingdom
 Cash Crop Yeild 0
Tanzania
 Cash Crop Yeild 0
United States
 Cash Crop Yeild 0
Uruguay
 Cash Crop Yeild 39580
Uzbekistan
 Cash Crop Yeild 43585
Vanuatu
 Cash Crop Yeild 11283
Venezuela
 Cash Crop Yeild 37119
Viet Nam
 Cash Crop Yeild 0
Wallis and Futuna Islands
 Cash Crop Yeild 0
Yemen
 Cash Crop Yeild 37851
Zambia
 Cash Crop Yeild 49272
Zimbabwe
 Cash Crop Yeild 55880

In [103]:
cashcrops1 = pd.DataFrame({
    'Area':country_item1,
    'Crop Yeild (kg/ha)':crop_output1,
    
})

cashcrops1

                          Area  Crop Yeild (kg/ha)
0                  Afghanistan               10000
1                      Albania               27944
2                      Algeria               24044
3               American Samoa                 542
4                       Angola               33265
..                         ...                 ...
187                   Viet Nam                   0
188  Wallis and Futuna Islands                   0
189                      Yemen               37851
190                     Zambia               49272
191                   Zimbabwe               55880

[192 rows x 2 columns]

In [104]:
# New dataframe
cashcrops2 = pd.merge(cashcrops, cashcrops1, how='inner', on='Area')
cashcrops2

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Crop Yeild (kg/ha)
0,QC,Crops,2,Afghanistan,5419,Yield,328,Cotton,2018,2018,hg/ha,10000,Fc,Calculated data,10000
1,QC,Crops,3,Albania,5419,Yield,328,Cotton Tobacco,2018,2018,hg/ha,11081,Fc,Calculated data,27944
2,QC,Crops,3,Albania,5419,Yield,826,Cotton Tobacco,2018,2018,hg/ha,16863,Fc,Calculated data,27944
3,QC,Crops,4,Algeria,5419,Yield,328,Cotton Tobacco,2018,2018,hg/ha,3077,Fc,Calculated data,24044
4,QC,Crops,4,Algeria,5419,Yield,826,Cotton Tobacco,2018,2018,hg/ha,20967,Fc,Calculated data,24044
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
380,QC,Crops,251,Zambia,5419,Yield,826,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,17659,Fc,Calculated data,49272
381,QC,Crops,181,Zimbabwe,5419,Yield,656,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,2419,Fc,Calculated data,55880
382,QC,Crops,181,Zimbabwe,5419,Yield,328,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,5625,Fc,Calculated data,55880
383,QC,Crops,181,Zimbabwe,5419,Yield,667,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,34722,Fc,Calculated data,55880
384,QC,Crops,181,Zimbabwe,5419,Yield,826,Coffee Cotton Tea Tobacco,2018,2018,hg/ha,13114,Fc,Calculated data,55880

In [105]:
cashcrops2.columns

Index(['Domain Code', 'Domain', 'Area Code', 'Area', 'Element Code', 'Element',
       'Item Code', 'Item', 'Year Code', 'Year', 'Unit', 'Value', 'Flag',
       'Flag Description', 'Crop Yeild (kg/ha)'],
      dtype='object')

In [106]:
cashcrops3 = cashcrops2.drop(columns=['Domain Code', 'Domain', 'Area Code','Element Code', 'Element',
       'Item Code','Year Code', 'Year', 'Unit', 'Value', 'Flag',
       'Flag Description' ])

cashcrops3

            Area                       Item  Crop Yeild (kg/ha)
0    Afghanistan                     Cotton               10000
1        Albania             Cotton Tobacco               27944
2        Albania             Cotton Tobacco               27944
3        Algeria             Cotton Tobacco               24044
4        Algeria             Cotton Tobacco               24044
..           ...                        ...                 ...
380       Zambia  Coffee Cotton Tea Tobacco               49272
381     Zimbabwe  Coffee Cotton Tea Tobacco               55880
382     Zimbabwe  Coffee Cotton Tea Tobacco               55880
383     Zimbabwe  Coffee Cotton Tea Tobacco               55880
384     Zimbabwe  Coffee Cotton Tea Tobacco               55880

[385 rows x 3 columns]

In [107]:
cashcrops4 = cashcrops3.drop_duplicates()
cashcrops5 = cashcrops4.rename(columns={'Area':'Entity'})

,Entity,Item_x,Crop Yeild (kg/ha)_x,"Agriculture, value added per worker (constant 2010 US$)",Urban Population (%),Employed in Agriculture(%),Item_y,Crop Yeild (kg/ha)_y
0,Afghanistan,Maize Rice Wheat,70283,761.461513,24.803,61.132000,Cotton,10000
1,Albania,Maize Soybeans Wheat,129029,5374.476370,57.434,41.366001,Cotton Tobacco,27944
2,Algeria,Maize Rice Wheat,76438,14065.123850,70.848,13.075000,Cotton Tobacco,24044
3,Argentina,Maize Rice Soybeans Wheat,200828,338735.911200,91.503,0.518000,Cotton Tea Tobacco,65207
4,Armenia,Maize Wheat,96336,6289.041997,63.085,35.328999,Tobacco,23257
...,...,...,...,...,...,...,...,...
119,Uruguay,Maize Rice Soybeans Wheat,207752,23018.482870,95.045,8.824000,Tobacco,39580
120,Uzbekistan,Maize Rice Soybeans Wheat,253296,3179.070812,50.750,22.846001,Cotton Tobacco,43585
121,Yemen,Maize Wheat,26544,873.961738,34.777,34.674999,Coffee Cotton Tobacco,37851
122,Zambia,Maize Rice Soybeans Wheat,122307,584.557209,41.907,53.666000,Coffee Cotton Tea Tobacco,49272
123,Zimbabwe,Maize Rice Soybeans Wheat,58047,293.152050,32.385,67.209999,Coffee Cotton Tea Tobacco,55880